{"id":13453,"date":"2019-03-11T11:00:43","date_gmt":"2019-03-11T11:00:43","guid":{"rendered":"https:\/\/theninehertz.com\/?p=13453"},"modified":"2019-12-05T05:35:59","modified_gmt":"2019-12-05T05:35:59","slug":"7-common-mistakes-testers-make","status":"publish","type":"post","link":"https:\/\/theninehertz.com\/blog\/7-common-mistakes-testers-make","title":{"rendered":"7 Common Mistakes Testers Make"},"content":{"rendered":"<p>When becoming a world-class tester, you’re bound to make some mistakes along the way. Everyone has to start somewhere, and let’s face it: mistakes do happen. Software testing is both an art and exact science. Whether you’re a new or experienced tester, it’s easy to fall for some of the most common mistakes.<\/p>\n<p>New testers, in particular, are likely to underestimate how complex testing can be. It’s not as simple as pushing buttons and waiting for the errors to come to you. Testing is very much a systematic analysis with a lot of moving parts. Quality testers understand market expectations. They know how to push software to exceed these expectations. They help develop feedback and warning indicators that are vital to a product’s success. When a tester makes a mistake, the entire product and reputation of the company are at risk.<\/p>\n<p>What are the most common mistakes made by both old and new testers? While some are expected issues like multi-tasking or overlooking simple problems, others might surprise you. Keep reading to explore the 7 common mistakes of software testers so you can avoid falling for any of these yourself.<\/p>\n<p><img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"aligncenter size-full wp-image-13455\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/03\/picture.jpg\" alt=\"picture\" width=\"940\" height=\"628\" \/><\/p>\n<p><a href=\"https:\/\/www.pexels.com\/photo\/person-looking-at-phone-and-at-macbook-pro-1181244\/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Image via Pexels<\/em><\/a><\/p>\n<h3 style=\"margin-top: 20px; margin-bottom: 20px;\">1. You don’t know the customers<\/h3>\n<p>As a tester, you need to know who your ideal user is. This is one of the most fundamental parts of testing. Users today have high expectations. They expect everything to work perfectly all of the time, and they have limited patience when things go wrong. Knowing your user expectations is essential to being a successful tester.<\/p>\n<p>What do you need to know about your target customers or users? Start with the basics: gender, age, demographic, income, app and web usage, and technological skills. From there, you can focus on how to better serve the customer with your testing. For instance, if you&#8217;re testing a mobile app that’s most likely going to be used on iPhones, don’t spend as much time testing Android. The customer comes first when testing.<\/p>\n<h3 style=\"margin-top: 20px; margin-bottom: 20px;\">2. You aren’t a strong communicator<\/h3>\n<p>Tech has a bad reputation for not attracting the best communicators. This probably comes from everyone spending so much time in front of the computer. There is no such thing as isolated silos in the development world anymore. Let’s push for better communication across teams.<\/p>\n<p>You need to learn how to express your thoughts and ideas clearly. You’ll likely be expected to not only work closely with <span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https:\/\/theninehertz.com\/mobile-application-development\/\" target=\"_blank\" rel=\"noopener noreferrer\">mobile app developers<\/a><\/span>, but also with managers, product owners, executives, and more. These people might not have a firm understanding of the specific product or problem, and it’s your job to facilitate understanding. Don’t settle for poor communication skills.<\/p>\n<h3 style=\"margin-top: 20px; margin-bottom: 20px;\">3. You love multitasking<\/h3>\n<p>A lot of people, not just testers, believe they’re strong multitaskers. The reality is <a href=\"https:\/\/www.telegraph.co.uk\/women\/womens-life\/11512469\/Multitasking-is-scientifically-impossible-so-give-up-nowMultitask.html\" rel=\"nofollow\">multitasking is impossible<\/a>. It just leads to poor execution, and it’s an easy way to let mistakes fall through the cracks. You’ll always finish your work faster by focusing on one task at a time. No matter how “Skilled” of a multitasker you think you are, it’s time to give it up.<\/p>\n<p>A more effective way to handle several tasks is to prioritize. Create a list of all your upcoming deadlines, and put the most impending problem first. While you’ll likely get used to working under strict deadlines, don’t fall for the temptation to do everything “at once.” You’ll only get farther behind.<\/p>\n<h3 style=\"margin-top: 20px; margin-bottom: 20px;\">4. You don’t test on different data networks<\/h3>\n<p>While you can count on a majority of users having access to fast-speed data or internet, that’s not always the case. When customers are on the move, they encounter different data networks that might not function the same. While fast data networks such as Wi-Fi or LTE are equipped to handle large downloads, it’s important to test even slower networks like GPRS.<\/p>\n<p>Not only has this, but apps and platforms needed to be equipped to handle rapid transitions. It’s unlikely a user will only utilize a new app inside his or her home, so transitions between networks should be seamless. Testers will need to move around to check for these different networks and carriers.<\/p>\n<p><img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"aligncenter size-full wp-image-13454\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/03\/pic.jpg\" alt=\"you-don’t-test-on-different-data-networks\" width=\"940\" height=\"624\" \/><\/p>\n<p><em><a href=\"https:\/\/www.pexels.com\/photo\/blur-close-up-code-computer-546819\/\" target=\"_blank\" rel=\"noopener noreferrer\">Image via Pexels<\/a><\/em><\/p>\n<h3 style=\"margin-top: 20px; margin-bottom: 20px;\">5. You test too soon<\/h3>\n<p>There is such a thing as working too quickly. It’s always exciting to dive into a new feature or product. However, moving too fast can leave you overlooking some much-needed structural procedures. You need to start every project with a strong understanding of the scope of the product, the requirements, and the expectations.<\/p>\n<p>Talk to the developers or the owner of the product. Host a test session to learn more about what you’re working with. These small steps are fundamental for creating a plan of action that works for this new product. All of these procedures exist for a reason.<\/p>\n<h3 style=\"margin-top: 20px; margin-bottom: 20px;\">6. You don’t check different languages<\/h3>\n<p>We live in a global world. Many companies are bridging gaps in communities and countries by offering apps in different languages. <a href=\"https:\/\/medium.com\/swift-india\/localize-your-apps-to-support-multiple-languages-ios-localization-ac7b612dbc58\" rel=\"nofollow\">Localizing your apps <\/a>in order to support multiple languages is a must if businesses want to stay competitive in a global world. As a tester, it’s your job to check the functionality of these languages.<\/p>\n<p>While you shouldn’t be expected to quality check different translations unless you’re hired to do so, there are areas worth checking. For instance, the word “logout” is common in many different applications, and this might translate differently to create challenges. In German, the word logout is much longer than the English version. Does it fit the allotted space? These are the small details that easily slip through the cracks. You don’t want to alienate any users of a different language because functionality doesn’t work throughout.<\/p>\n<h3 style=\"margin-top: 20px; margin-bottom: 20px;\">7. Finally, you fail to review logs<\/h3>\n<p>Last but not least, security is of the utmost importance today. Businesses of all sizes are facing the risk of data breach and cyber-attacks. Apps and web platforms need to be tested to ensure only the permissions required are being used. Private data needs to be protected at all costs and this requires multiple lines of defense.<\/p>\n<p>Logging is an important part of checking for potential attacks and errors that might not be seen otherwise. Mobile app testers can connect to their computer to review any log files and find possible warnings. Beyond this, the log level should keep the restrictions tight to avoid information being shown to the wrong users. <a href=\"https:\/\/www.loggly.com\/blog\/logging-exceptions-in-java\/\">Logging exceptions in Java<\/a> ensures no stone goes unturned.<\/p>\n<p>App security is important at every stage of <a href=\"https:\/\/theninehertz.com\/mobile-app-prototyping\/\" target=\"_blank\" rel=\"noopener noreferrer\">app development process<\/a>, but it’s especially important in these testing stages. Cybersecurity is no joke. The more you can learn about logging, monitoring, and preventing attacks, the stronger your skills are as a tester.<\/p>\n<h3 style=\"margin-top: 20px; margin-bottom: 20px;\">Conclusion<\/h3>\n<p>Software testing is an ever-changing career that offers unique challenges. As a tester, you work with all teams to make products a functional reality. By honing your craft, you can improve your skills on all levels. Though making the mistakes above will cost you if they happen too often, it’s important you don’t beat yourself up over small mistakes.<\/p>\n<p>Minor issues will happen. You can’t let them affect you. As long as you’re learning from them, you’re acquiring new skills that make you a better tester. It’s easy to feel like all production issues are a <a href=\"https:\/\/www.ministryoftesting.com\/dojo\/lessons\/why-didn-t-you-find-that-bug\" rel=\"nofollow\">result of bad testing<\/a>. All you can do is keep moving forward, and focus on learning as you go. Have you found yourself making any of these mistakes? If so, you’re not alone. Let them empower you to become a better tester in the future.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When becoming a world-class tester, you’re bound to make some mistakes along the way. Everyone has to start somewhere, and let’s face it: mistakes do happen. Software testing is both an art and exact science. Whether you’re a new or experienced tester, it’s easy to fall for some of the most common mistakes. New testers, [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":13456,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[323,20],"tags":[188,35,322,324,325],"yst_prominent_words":[],"_links":{"self":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/13453"}],"collection":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/comments?post=13453"}],"version-history":[{"count":1,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/13453\/revisions"}],"predecessor-version":[{"id":20909,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/13453\/revisions\/20909"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media\/13456"}],"wp:attachment":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media?parent=13453"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/categories?post=13453"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/tags?post=13453"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/yst_prominent_words?post=13453"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}