{"id":14890,"date":"2019-04-26T10:57:47","date_gmt":"2019-04-26T10:57:47","guid":{"rendered":"https:\/\/theninehertz.com\/?p=14890"},"modified":"2019-04-26T10:57:47","modified_gmt":"2019-04-26T10:57:47","slug":"factors-that-rules-the-cost-of-an-ios-app-development","status":"publish","type":"post","link":"https:\/\/theninehertz.com\/blog\/factors-that-rules-the-cost-of-an-ios-app-development","title":{"rendered":"Factors That Rules the Cost of iOS App Development"},"content":{"rendered":"<p>Mobile applications have become a deeply rooted part of our day to day professional and social lives. The applications which were originally inclined towards productivity assistance like Calendar, Email and Contact Databases are now intended towards catering to the needs of public demands.<\/p>\n<p>Areas like mobile games, lifestyle, location-based services, on-demand services, etc. are attracting a large audience by incorporating the latest <strong><span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https:\/\/theninehertz.com\/ios-application-development\/\">ios app development <\/a><\/span><\/strong>trends. Over a decade, mobile app development trends have changed dynamically in proportional to mobile technologies.<\/p>\n<p>If you are looking for developing an iOS application for your business, then the following questions must arise in your mind:<\/p>\n<ul>\n<li>Why do you need an iOS app?<\/li>\n<li>How your app is benefiting your user?<\/li>\n<li>How much is your Budget?<\/li>\n<li>Who are your competitors?<\/li>\n<\/ul>\n<p>These questions will serve as the base for deciding further app development parameters. If you know the answer of the above questions then move ahead with this article to build your knowledge ahead with iOS application development.<\/p>\n<p>In this article, we will discuss the various parameters that impact either positively or negatively on the development cost of an iOS application.<\/p>\n<h2 style=\"margin-top: 20px; margin-bottom: 20px;\"><span style=\"color: #3366ff;\">1. Some Facts and Figure<\/span><\/h2>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; Market Overview<\/h3>\n<p>The market of smartphone users has steadily and significantly increased in the past few years and it is forecast that it will increase in the upcoming years as well. If we talk about the US, then the number of smartphone users in the US has rapidly grown since 2010.<\/p>\n<p>The number of smartphone users has reached to 257.3 million in 2018 from 62.6 million in 2010. According to <span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https:\/\/www.statista.com\/statistics\/201182\/forecast-of-smartphone-users-in-the-us\/\" target=\"_blank\" rel=\"noopener noreferrer\">statista<\/a> <\/span>report, it is estimated that the number is going to hit 285.3 million by 2023.<\/p>\n<p><img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"aligncenter wp-image-14891 size-full\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/04\/stats1.png\" alt=\"Market-overview-smartphones-users\" width=\"689\" height=\"447\" \/><\/p>\n<p>(Source: Statista)<\/p>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; Smartphones Market Share by Brand and Operating System<\/h3>\n<p>The most popular smartphone brands in America are Samsung and Apple. In addition to this, iOS and Android hold large market shares followed by Blackberry OS, Bada and Windows.<\/p>\n<p>According to <span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https:\/\/www.statista.com\/statistics\/266572\/market-share-held-by-smartphone-platforms-in-the-united-states\/\" target=\"_blank\" rel=\"noopener noreferrer\">statista<\/a><\/span> report, 54.4% of smartphone users are using Google Android device while Apple holds a 44.3% market share in 2018. In 2017, there were 97.2 million iPhone users in the US.<\/p>\n<p>Currently, iPhone is the highest sold smartphone in the US followed by Android devices. If we talk about popular iOS app category worldwide, then social networking apps have 90.89% market reach globally in 2018.<\/p>\n<h2 style=\"margin-top: 20px; margin-bottom: 20px;\"><span style=\"color: #3366ff;\">2. iOS Development Trends to follow in 2019<\/span><\/h2>\n<p>Technology and trends are dynamic in nature, with each passing year they are evolving to deliver the best user experience. Apple has always incorporated the latest trends into their upcoming applications and updates. In 2019, new trends will boost the advancement in the iOS app development.<\/p>\n<p>Here is the list of the latest iOS app development drifts that will drive the user-engagement in 2019.<\/p>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; Expecting iOS 13<\/h3>\n<p>It is expected that Apple is going to introduce iOS 13 in its upcoming WWDC 2019 conference which will take place from June 3 to June 7. With iOS 13, iOS app developers can expect some major redesign in your iPhones and tablets.<\/p>\n<p><img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"wp-image-14895 alignleft\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/04\/latest-iOS13.jpg\" alt=\"latest iOS13\" width=\"270\" height=\"307\" \/> <img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"aligncenter wp-image-14894\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/04\/iOS13-dark-mode.jpg\" alt=\"iOS13 dark mode\" width=\"495\" height=\"260\" \/><\/p>\n<p>(Source: Google Images)<\/p>\n<h4><strong><br \/>\n<em>What to expect from iOS 13?<\/em><\/strong><\/h4>\n<p><strong>Home screen redesign:<\/strong> The background layout is all DARK. (Dark mode designs).<\/p>\n<p><strong>Improved multitasking features for the iPad:<\/strong> iOS 13 will offer multiple windows open in the same application using a tab view.<\/p>\n<p><strong>Undo option on the keyboard:<\/strong> You can just triple tap and swipe left to Undo or triple tap and swipe right to Redo on your keyboard.<\/p>\n<p><strong>Smarter mail:<\/strong> Mail app with multiple item selection similar to Gmail like marketing, travel, purchases, etc.<\/p>\n<p><strong>Cross-platform iOS and Mac Apps:<\/strong> Apple is working on bringing iOS apps to Mac.<\/p>\n<p><strong>Note: <\/strong>Thus, developers need to make sure that the new applications that they are designing adhere to these changes and run smoothly on new iOS version i.e iOS 13.<\/p>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; Swift 5<\/h3>\n<p>Apple is expected to introduce Swift 5 in 2019 after the popularity and benefits of Swift 4 last year. Swift is a compact and powerful language that is inclined towards security and scalability of iOS applications.<\/p>\n<p>Swift 5 will promote Application Binary Interface (ABI) as the prominent feature of iOS apps along with other advanced features.<\/p>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; Implementation of AR\/VR<\/h3>\n<p>Last year ARKit 2 has offered iOS developers to develop an app with flexibility and ability of shared experience to multiple users in the same AR surroundings. This feature of <span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https:\/\/theninehertz.com\/blog\/augmented-reality-ios-12\/\" target=\"_blank\" rel=\"noopener noreferrer\">ARKit 2<\/a><\/span> has offered an advantage to game developers to create a multiplayer game.<\/p>\n<p>This year, many enterprises like Amazon are going to collaborate with Apple to leverage the benefits of ARKit 2.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><iframe src=\"https:\/\/www.youtube.com\/embed\/gZhQCVSvq5E\" width=\"560\" height=\"315\" frameborder=\"0\" align=\"center\" allowfullscreen=\"allowfullscreen\"><span data-mce-type=\"bookmark\" style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" class=\"mce_SELRES_start\">﻿<\/span><\/iframe><\/p>\n<p>(Source: CNET)<\/p>\n<p>&nbsp;<\/p>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; Artificial Intelligence and Siri<\/h3>\n<p>To offer users a hands-free experience, Apple has introduced Siri and AI. In 2018, Apple introduces Siri in <span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https:\/\/theninehertz.com\/blog\/ios-12-public-beta-3-update\/\" target=\"_blank\" rel=\"noopener noreferrer\">iOS 12<\/a><\/span>, which provide you suggestions like call your grandma for her birthday, turn your phone to Do Not Disturb at the Movie Theater, etc.<\/p>\n<p>The advanced use of AI and Siri is still being explored by the developers to deliver high-quality iOS applications to users.<\/p>\n<p><img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"aligncenter size-full wp-image-14901\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/04\/Artificial-Intelligence-and-Siri.jpg\" alt=\"Artificial Intelligence and Siri\" width=\"750\" height=\"420\" \/><\/p>\n<p>(Source: SoftMediaLab)<\/p>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; IoT and Wearable Devices<\/h3>\n<p>Apple has worked significantly on IoT and wearable applications that connect and run smoothly of different IoT devices. In 2019, iOS app developers are going to focus on wearable devices like Apple Watch Series, fitness, movement trackers, etc.<\/p>\n<h2 style=\"margin-top: 20px; margin-bottom: 20px;\"><span style=\"color: #3366ff;\">3. How much does it cost to develop an iOS app?<\/span><\/h2>\n<p>It is very easy to ask any <strong><span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https:\/\/theninehertz.com\/blog\/top-10-ios-app-development-companies-2018-2019\/\" target=\"_blank\" rel=\"noopener noreferrer\">iOS app development company<\/a><\/span><\/strong> about the total cost involved in designing and developing an iOS app. But actually, it is the toughest question to answer!! The reason is app development cost depends on a number of parameters.<\/p>\n<p>Following are some of the parameters that decide the costing of an iOS app.<\/p>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; Factors that impact\/hike the cost<\/h3>\n<p>a) Development cost of an iOS app is driven by features, platform, coding language, and complexity associated with the project idea.<\/p>\n<p>b)Whether hiring an offshore team or high-end development agency.<\/p>\n<p>c)Type of app (social, government, business-oriented, etc.).<\/p>\n<p>d)Global rates per hour.<\/p>\n<p>e)Developing an app with a back-end will cost more.<\/p>\n<p><img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"aligncenter wp-image-14902\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/04\/iOS-app-development-cost-graph.jpg\" alt=\"iOS- app-development-cost-graph\" width=\"378\" height=\"326\" \/><\/p>\n<h4>Factor 1: Features<\/h4>\n<p>Features play an important role in deciding the cost of development. Every business requires a particular set of basic features and some customized advance features to fulfill the objective of their application development for their business.<\/p>\n<p>For example, features like sign up, registration, menu, order, etc. are some of the basic features in an on-demand food delivery app. However, features like GPS navigational system, <a href=\"https:\/\/theninehertz.com\/blog\/11-best-payment-processing-libraries-for-your-ios-app\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #3366ff;\">multiple payment gateways<\/span><\/a>, admin panel, security, etc. are advanced features that require the meticulous implementation of codes to ensure the safe and secure operation of the app.<\/p>\n<p><strong>Note<\/strong>: As the complexity of features increases, the cost of iOS app development also increases.<\/p>\n<p style=\"text-align: center;\"><em><strong style=\"background-color: #ffff00;\">Cost α Complexity of Features<\/strong><\/em><\/p>\n<h4 style=\"margin-top: 30px;\">Factor 2: UI\/UX Designing<\/h4>\n<p>Designing a presentable layout for your application is necessary to create an interactive user experience. To offer exclusive design to your users, use the latest UI\/UX design trends and build user-friendly and easy to navigate applications.<\/p>\n<p style=\"text-align: center;\"><em><strong style=\"background-color: #ffff00;\">Cost α Quality of Design<\/strong><\/em><\/p>\n<h4 style=\"margin-top: 30px;\">Factor 3: Technical Complexity<\/h4>\n<p>The technical challenge that creates a hurdle for <strong><span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https:\/\/theninehertz.com\/blog\/hiring-steps-ios-developer\/\" target=\"_blank\" rel=\"noopener noreferrer\">iOS app developers<\/a><\/span><\/strong> is third-party integration. The technical aspects implementation like adding chatbot, social media compatibility or payment gateways with 3<sup>rd<\/sup> party API integration is the crucial and complex technical part of the whole development cycle.<\/p>\n<p>The more features you want to incorporate the more complex the coding becomes and more the cost of development.<\/p>\n<p style=\"text-align: center;\"><em><strong style=\"background-color: #ffff00;\">Cost α Technicality α Complexity<\/strong><\/em><\/p>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; Strategies to Reduce Cost<\/h3>\n<p>When strategies are made precisely and with the utmost care, then there are ways to reduce the costing of the iOS app development project. Reducing cost does not mean that at any step of the iOS app development, the quality of the final outcome will be compromised.<\/p>\n<p>Following are some of the key points that ensure that cost optimization can be done while developing an iOS app.<\/p>\n<ul>\n<li><strong>Don’t rush for launching an app with bugs left unattended:<\/strong> Most of us want to launch our mobile application as soon as possible and thus, we miss the minute mistakes that later own requires application update. Remember, app update adds to iOS app development costs. Thus, always check and test your application for quality and bug-free operation. It is not advisable to update your app as soon as the app release.<\/li>\n<li><strong>Use Cross-Platform app development:<\/strong> If you are planning to run your application on multiple platforms then use platforms like Xamarin to develop a hybrid app that shares code for both iOS and Android platform. However, if you are not focusing on multiple platform app development then you can opt for Swift 5 language to design and develop your iOS application.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3 style=\"margin-top: 10px; margin-bottom: 10px;\"><em><strong>“Some Additional Knowledge”<\/strong><\/em><\/h3>\n<p><strong><em> <\/em><\/strong><strong><em>Swift 5:<\/em><\/strong><em> It offers interactive and developer friendly code, the syntax is concise and Swift offers secure and safe code to design.<\/em><\/p>\n<p><em> <img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"wp-image-14898 alignleft\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/04\/NewSwift5-feature.png\" alt=\"New Swift5-feature\" width=\"180\" height=\"180\" \/><\/em><\/p>\n<p><span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https:\/\/developer.apple.com\/swift\/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong><em>Features of Swift 5<\/em><\/strong><\/a><\/span><strong><em>:<\/em><\/strong><\/p>\n<p><em>&#8211; Faster code as String re-implemented with UTF-8 encoding.<\/em><\/p>\n<p><em>&#8211; Performance boost up in Dictionary and Set.<\/em><\/p>\n<p><em>&#8211; Offering unique access to memory<\/em><\/p>\n<p><em><\/em><em>&#8211; Supports dynamic collaboration with languages such as Python, JavaScript, and Ruby.<\/em><\/p>\n<h3 style=\"margin-top: 30px; margin-bottom: 10px;\">&#8211; Cost of iOS App Development<\/h3>\n<p>According to the clutch survey, an expert iOS app development agency charge approx., $171,000 for creating a full-fledged application. Whereas a leading app development company offering a dozen of customizing features may charge between $100,000 and $500,000.<\/p>\n<p>A small or startup company may charge around $10,000 &#8211; $40,000 for basic app features. The cost of development also depends on the type of application you want to develop and for which industry vertical. If you want to develop an application for eCommerce business, then you need to implement a more secure platform for protecting and securing payment gateways.<\/p>\n<p>Whereas, for a social media platform like Facebook, Instagram, etc. you need to implement a two-way security system to ensure user data is protected. Thus, here the cost of app development increase as compared to other domain applications.<\/p>\n<table class=\"table table-bordered\" style=\"margin-top: 30px;\">\n<tbody>\n<tr>\n<td width=\"156\">\n<p style=\"text-align: center;\"><strong>   Level Complexity<\/strong><\/p>\n<\/td>\n<td style=\"text-align: center;\" width=\"156\"><strong>Average Features<\/strong><\/td>\n<td style=\"text-align: center;\" width=\"156\"><strong>Avg. Time Required<\/strong><\/td>\n<td style=\"text-align: center;\" width=\"156\"><strong>Avg. Cost at $50\/hours<\/strong><\/td>\n<\/tr>\n<tr>\n<td width=\"156\">\n<p style=\"text-align: center;\">Simple<\/p>\n<\/td>\n<td width=\"156\">\n<p style=\"text-align: center;\">Email Subscription, Login, Calendar, Social Login, etc.<\/p>\n<\/td>\n<td width=\"156\">\n<p style=\"text-align: center;\">300-400 hours<\/p>\n<\/td>\n<td width=\"156\">\n<p style=\"text-align: center;\">$20,000<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"156\">\n<p style=\"text-align: center;\">Moderate<\/p>\n<\/td>\n<td width=\"156\">\n<p style=\"text-align: center;\">Custom UI\/UX Designs, API Integration, Back-end Server, Two-way Security, etc.<\/p>\n<\/td>\n<td width=\"156\">\n<p style=\"text-align: center;\">500-700 hours<\/p>\n<\/td>\n<td width=\"156\">\n<p style=\"text-align: center;\">$35,000<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"text-align: center;\" width=\"156\">Complex<\/td>\n<td style=\"text-align: center;\" width=\"156\">3<sup>rd<\/sup> Party Integration, Custom iOS Development, Real-Time Features, Secure, Scalable, etc.<\/td>\n<td style=\"text-align: center;\" width=\"156\">700-1400 Hours<\/td>\n<td width=\"156\">\n<p style=\"text-align: center;\">$70,000<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<h2 style=\"margin-top: 20px; margin-bottom: 20px;\"><span style=\"color: #3366ff;\">4. Our iOS app development process at The NineHertz<\/span><\/h2>\n<p><img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"aligncenter size-full wp-image-14903\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/04\/online-1.png\" alt=\"development-process\" width=\"560\" height=\"315\" \/><\/p>\n<p>To design prominent applications that furnish the needs of businesses and satisfies users’ expectations, we at The NineHertz follows our meticulously structured development strategies.<\/p>\n<p>Here are the steps that we follow to build robust, scalable and technically strong applications:<\/p>\n<ul>\n<li><strong>Requirement Analysis:<\/strong> In this step, we analyze the client’s requirements. After gathering all data requirements, we perform thorough market research to understand the user-base and comprehend the client’s requirements with the users’ demands.<\/li>\n<li><strong>Proposing a Solution\/Scope Freezing:<\/strong> After all the data analysis, our team of technical managers along with marketing managers decides a unique sales-driven solution to meet the needs of the business.<\/li>\n<li><strong>Wireframing and Designing:<\/strong> Prototyping the structure of the application. Wireframing each screen and starting with app designing. In this step, we transfer the knowledge to the development team. And our iOS app developers start their work by implementing the latest technologies (Swift 5, ARKit, etc.) to build an application that elite user experience.<\/li>\n<li><strong>App Development:<\/strong> We code the application keeping three parameters in mind: Fast, Secure and Scalable. We involve our clients at each development stage to fasten the development process and minimize the bugs in the process.\n<p style=\"margin-top: 20px;\">We use the following technologies:<\/p>\n<p style=\"margin-left: 15px; margin-bottom: 10px;\"><strong>Languages<\/strong>: Objective C, Swift (Swift 5)<\/p>\n<p style=\"margin-left: 15px; margin-bottom: 10px;\"><strong>IDE<\/strong>: XCode<\/p>\n<p style=\"margin-left: 15px; margin-bottom: 10px;\"><strong>Framework<\/strong>: Kotlin, Xamarin, Firebase, Alamofire, Kingfisher, Google Map, AFNetworking, etc.<\/p>\n<p style=\"margin-left: 15px; margin-bottom: 10px;\"><strong>Database<\/strong>: SQLite, Realm, CoreData, etc.<\/p>\n<p style=\"margin-left: 15px; margin-bottom: 10px;\"><strong>Architecture<\/strong>: MVC, MVVM, and VIPER<\/p>\n<\/li>\n<\/ul>\n<ul>\n<li><strong>Support and Maintenance:<\/strong> We offer our clients with pre and post-delivery services to make sure that their mobile apps work smoothly in long-term.<\/li>\n<li><strong>QA and Testing:<\/strong> To deliver 100% bug-free application, our QA team takes into consideration every minute details to assure the above said. We use manual and automation testing tools to double check our work. Thus, we deliver the best in industry solutions.<\/li>\n<li><strong>Deployment:<\/strong> In this step, we deploy full-functioning applications that are running smoothly and hassle-free on the App Store. Our innovative applications meet their beautiful users and drive sales and revenue for our clients business<\/li>\n<\/ul>\n<h2 style=\"margin-top: 20px; margin-bottom: 20px;\"><span style=\"color: #3366ff;\">5. Best 5 tips for developing the iOS application- iOS Developers Reminders<\/span><\/h2>\n<p>If you are a beginner in iOS development then these tips are important for you to learn for developing a seamless application.<\/p>\n<p>Tip#1: Structure your iOS app by keeping minuscule details into consideration.<\/p>\n<p>Tip#2: Design simple layout, don’t forget simple is elegant and easy to navigate. User should not get confused with the design. So make it simple and user-friendly rather than fancy.<\/p>\n<p>Tip#3: Code accurately and choose a platform you are comfortable with in initial projects and then can go with higher versions.<\/p>\n<p>Tip#4: Your application should be compatible with all iOS versions and devices. Thus, create responsive designs.<\/p>\n<p>Tip#5: Make your app feature-rich and user interactive.<\/p>\n<p>&nbsp;<\/p>\n<p><img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"aligncenter size-full wp-image-14904\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2019\/04\/Cost-of-iOS-App-Development.png\" alt=\"Cost of iOS App Development\" width=\"800\" height=\"2000\" \/><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Mobile applications have become a deeply rooted part of our day to day professional and social lives. The applications which were originally inclined towards productivity assistance like Calendar, Email and Contact Databases are now intended towards catering to the needs of public demands. Areas like mobile games, lifestyle, location-based services, on-demand services, etc. are attracting [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":14964,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[362,20],"tags":[361,108,363,364,365,366],"yst_prominent_words":[],"_links":{"self":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/14890"}],"collection":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/comments?post=14890"}],"version-history":[{"count":0,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/14890\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media\/14964"}],"wp:attachment":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media?parent=14890"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/categories?post=14890"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/tags?post=14890"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/yst_prominent_words?post=14890"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}