{"id":27981,"date":"2020-05-20T14:57:20","date_gmt":"2020-05-20T14:57:20","guid":{"rendered":"https:\/\/theninehertz.com\/?p=27981"},"modified":"2020-06-04T18:11:54","modified_gmt":"2020-06-04T18:11:54","slug":"guide-and-must-known-facts-of-cross-platform-app-development-in-2020","status":"publish","type":"post","link":"https:\/\/theninehertz.com\/blog\/guide-to-cross-platform-app-development-in-2020","title":{"rendered":"Guide And Must Known Facts Of Cross Platform App Development In 2020"},"content":{"rendered":"<p>&#8220;Are you looking for budget-friendly mobile applications? Do you want an application that reaches a wider audience? Want to hire <a href=\"https:\/\/theninehertz.com\/cross-platform-app-development\" style=\"color: #3366ff;\">cross-platform app development company<\/a> for your dream project? For all of these questions, there’s one solution, i.e. cross-platform application development services. How does it save money? How does it benefit you? Let’s find out with this complete guide of 2020 showing the advancements of cross-platform mobile app development.&#8221;<\/p>\n<p>Cross-platform is among those platforms which have made mobile application development easy and highly used among the coders.<\/p>\n<p>In the modern era, the lives of people have been surrounded by mobile phones. This gadget is no longer used to make calls and texts. Moreover, it has its importance in the daily activity of humans. From a small reminder to booking flight tickets, the mobiles played a crucial role. That is the reason this 6-inch screen is considered as a basic need of the 21st century. But what made it so important to us? Well, the various applications in the mobile which do their respective work to make our lives easygoing. With the various applications, the various platforms are introduced for mobile phones such as Windows, iOS, Android, BlackBerry, etc.<\/p>\n<p>The world is divided into these platforms using their compatible application. Whenever a businessman thinks to deploy its business online, he tries to gain the attention of almost every user. The application owner plans the idea of the targeted audience and makes sure he spends less money on building it and captures more attention from users.<\/p>\n<p>In such cases, a businessman needs to build an application separately on each platform to get the overall audience. This may increase the cost of building and sometimes it may be a hassle for the coders to implement the same functionality and feature in different platforms. the technology has waived its magic wand and introduced a platform that has solved this problem. One can now create the code once and runs it on different platforms. This kind of multiplatform or independent platform development. It is named as cross-platform development. Is it worth using? Let&#8217;s find out its pros and cons!<\/p>\n<p><iframe title=\"What is Cross Platform Development? - Mobile and Desktop Explained\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/TWFUSxqMJic?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">Which is Better? Native or Cross-Platform?<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/05\/Inner-Which-is-Better-Native-vs-Cross.jpg\" alt=\"Which-is-Better-Native-vs-Cross\" \/><\/p>\n<p>Both technologies proved their worth. But which technology has performed well and is loved worldwide. Developers around the world always develop something new which replaces the previous technology or has a better version of it.<\/p>\n<p>Native is specifically made for a single platform that allows developers to develop only for a single platform. For eg: Android accepts java, Apple accepts Objective C and swift. These separations of platforms and technology help the developers to build any app with a wide range of compatible options. Whereas cross-platform has merged both Android and iOS and works on HTML and CSS, It allows the developer to create a single code for multiple platforms. These were the basic introduction of both technologies. Now, let&#8217;s find out whether the native is better or cross-platform has higher users.<\/p>\n<table class=\"table table-bordered\">\n<tbody>\n<tr>\n<th>FACTORS<\/th>\n<th>NATIVE PLATFORM<\/th>\n<th>CROSS-PLATFORM<\/th>\n<\/tr>\n<tr>\n<td>Deployment cost for multiple platforms<\/td>\n<td>Deployment cost higher as app architecture adoption is different<\/td>\n<td>Cross platform requires little cost to deploy as code is the same and no architecture needed<\/td>\n<\/tr>\n<tr>\n<td>Time of development<\/td>\n<td>It takes longer time as code written from scratch for each platform<\/td>\n<td>Cross platform allows code to be written once and run on multiple platforms<\/td>\n<\/tr>\n<tr>\n<td>Audience reach<\/td>\n<td>Developing an app in single platform may lose 50% users of other platforms<\/td>\n<td>It allows app to run for multiple platforms to reach wider range of users<\/td>\n<\/tr>\n<tr>\n<td>Designing techniques<\/td>\n<td>Designs are simplified and support is given by the respective operating system<\/td>\n<td>In Cross-platform, developers add some additional features<\/td>\n<\/tr>\n<tr>\n<td>Cost for hiring developers<\/td>\n<td>Native developers cost high as they have expertise in single platform<\/td>\n<td>Cross platforms are easier to find and hiring them is pocket-friendly<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<blockquote>\n<p><strong>Also Read:<\/strong>&nbsp;<a class=\"line\" href=\"https:\/\/theninehertz.com\/blog\/everything-about-cross-platform-apps-infographic\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #ff0000;\">Everything About Cross-Platform Apps – Infographic<\/span><\/a><\/p>\n<\/blockquote>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">Pros And Cons Of Cross-Platform Mobile App Development<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/05\/Inner-Pros-and-cons-of-cross-platform.jpg\" alt=\"Pros-and-cons-of-cross-platform\" \/><\/p>\n<p>Every coin has two sides and so with the technology. No matter how beneficial or popular technology is. It always has some drawbacks. Let’s have a quick tip over some advantages and disadvantages of cross-platform app development.<\/p>\n<h3 style=\"font-size: 17px;\">Pros of Cross-Platform Mobile App Development:<\/h3>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\">Customization of plugins<\/li>\n<li style=\"list-style: square;\">Reduced the development cost<\/li>\n<li style=\"list-style: square;\">Increase the time to market<\/li>\n<li style=\"list-style: square;\">Easy integration<\/li>\n<li style=\"list-style: square;\">Reduced the efforts in the development<\/li>\n<li style=\"list-style: square;\">Easy maintenance<\/li>\n<li style=\"list-style: square;\">A large community of experts<\/li>\n<\/ul>\n<h3 style=\"font-size: 17px;\">Cons of Cross-Platform Mobile App Development:<\/h3>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\">Its update does not include all the supporting features<\/li>\n<li style=\"list-style: square;\">Tools used have certain restrictions<\/li>\n<li style=\"list-style: square;\">Code may have inefficiency<\/li>\n<li style=\"list-style: square;\">Apps sometimes crash<\/li>\n<li style=\"list-style: square;\">No-alluring UX<\/li>\n<\/ul>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">Business Benefits of Cross-Platform App Development<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/05\/Inner-Business-Benefits-of-Cross-Platform.jpg\" alt=\"Business-Benefits-of-Cross-Platform\" \/><\/p>\n<ol style=\"padding-left: 5%;\">\n<li style=\"list-style: decimal;\"><b>Code once runs multiple times:<\/b> Developer needs to code once on this platform and can run the code on other platforms. Thus, it needs little customization along with the type of platform which is being used.<\/li>\n<li style=\"list-style: decimal;\"><b>Quick and less cost:<\/b> The developer does not spend much on coding for each platform. This is one of the major benefits of using the cross-platform because it allows users of the code several times. It leads to quicker development and paces up the growth of the business.<\/li>\n<li style=\"list-style: decimal;\"><b>Cloud storage:<\/b> The platforms provide high security and authentication. The application can be accessible across the globe and businessmen can gain a lot of advantage from it. It also takes a quicker time to load than native apps.<\/li>\n<li style=\"list-style: decimal;\"><b>Auto updated:<\/b> Whenever an app gets a new update, it has to be approved by the app store. Cross-platform allows automatic updates,i.e., an owner can release the app without taking much time in distributing updates.<\/li>\n<li style=\"list-style: decimal;\"><b>Same UI elements:<\/b> The developer in native app development faces an issue of UI design variation in different platforms which may decrease the audience interest. This issue has been resolved by multiple platform development, thus, displaying the same UI elements on each platform regardless of any factor.<\/li>\n<\/ol>\n<blockquote>\n<p><strong>Also Read:<\/strong>&nbsp;<a class=\"line\" href=\"https:\/\/theninehertz.com\/blog\/cross-platform-for-fintech-industry-8-innovative-features-for-banking-application-development\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #ff0000;\">Cross-Platform for FinTech Industry: 8 Innovative Features for Banking Application Development<\/span><\/a><\/p>\n<\/blockquote>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">Top Cross-platform Mobile App Development Tools Frameworks<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/05\/Inner-Top-Cross-platformMobile-App-Development-Tools.jpg\" alt=\"Top-Cross-platform-Mobile-App-Development-Tools\" \/><\/p>\n<p>The world has widely accepted and uses the cross-platform for creating applications for their respective business. With popular technology comes a wide range of <a href=\"https:\/\/theninehertz.com\/blog\/6-trends-you-may-have-missed-about-cross-platform-frameworks-in-2020\" style=\"color: #3366ff;\">cross-platform tools and frameworks<\/a>. These frameworks help the developers to create the application cross-platform within the easiest way. Every tool is unique and has some features which contribute to making cross-platform famous among the developers’ community. Let’s find out top cross-platform mobile app development tools and frameworks.<\/p>\n<h3 style=\"font-size: 17px;\">React Native<\/h3>\n<p><a href=\"https:\/\/reactjs.org\/\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">React framework<\/a> allows developers to reuse the code and shorten the time frame of development. It uses JavaScript to develop web and mobile applications. It is an open-source framework and has several plugins provided to developers. Renowned apps such as Facebook and Instagram are made using react-native.<\/p>\n<h3 style=\"font-size: 17px;\">Xamarin<\/h3>\n<p><a href=\"https:\/\/en.wikipedia.org\/wiki\/Xamarin\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">Xamarin<\/a> is owned by Microsoft, works on Write once run anywhere model. It is open-source which allows developers from worldwide to share their experience and work. This framework uses C#. The best thing about it is, the code written in this framework can be reused for multiple platforms.<\/p>\n<h3 style=\"font-size: 17px;\">Ionic<\/h3>\n<p><a href=\"https:\/\/ionicframework.com\/\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">Ionic<\/a> is an open-source platform which works on HTML and CSS technologies. MIT holds Ionic&#8217;s license and is widely used in many application developments. For better results, it is combined with AngularJS and provides a variety of tools and components.<\/p>\n<h3 style=\"font-size: 17px;\">Flutter<\/h3>\n<p><a href=\"https:\/\/flutter.dev\/\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">Flutter<\/a> is owned by Google, it is an open-source, cross-platform application development framework which allows <a href=\"https:\/\/theninehertz.com\/hire-flutter-developer\" style=\"color: #3366ff;\">Flutter developers<\/a> to write code once and run it on multiple platforms. It uses Dart programming language which reduces the testing efforts. The widget used in flutter made the customization easy. The flutter mobile app development is in demand and many people are showing interest in developing their applications in it.<\/p>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">Xamarin vs React Native vs Ionic vs Flutter<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/05\/Inner-Xamarin-vs-React-Native-vs-Ionic-vs-Flutter.jpg\" alt=\"Xamarin-vs-React-Native-vs-Ionic-vs-Flutter\" \/><\/p>\n<p>People often get confused about choosing the frameworks. One should choose the frameworks which fulfil your business requirements. Every framework has some unique feature that contributes to efficiency in the cross-platform framework. Here is the comparison of widely used cross-platform mobile app frameworks.<\/p>\n<table class=\"table table-bordered\">\n<tbody>\n<tr>\n<th>CHARACTERISTICS<\/th>\n<th>REACT NATIVE<\/th>\n<th>XAMARIN<\/th>\n<th>IONIC<\/th>\n<th>FLUTTER<\/th>\n<\/tr>\n<tr>\n<td>Programming Language<\/td>\n<td>JavaScript, Objective C, Swift<\/td>\n<td>C#, .Net<\/td>\n<td>HTML, CSS, JavaScript<\/td>\n<td>DART<\/td>\n<\/tr>\n<tr>\n<td>Performance<\/td>\n<td>Slightly similar to native<\/td>\n<td>Close to native but moderate<\/td>\n<td>Moderate<\/td>\n<td>Outstanding<\/td>\n<\/tr>\n<tr>\n<td>GUI<\/td>\n<td>Require Native<\/td>\n<td>Same as React<\/td>\n<td>HTML, CSS<\/td>\n<td>Use widget for finest UI<\/td>\n<\/tr>\n<tr>\n<td>Code Reusability<\/td>\n<td>90% code reusability<\/td>\n<td>97% code reusability<\/td>\n<td>99% code reusability<\/td>\n<td>69-90% code reusability<\/td>\n<\/tr>\n<tr>\n<td>Community Support<\/td>\n<td>Strongest<\/td>\n<td>Lesser than native<\/td>\n<td>Strong<\/td>\n<td>Less popular<\/td>\n<\/tr>\n<tr>\n<td>Pricing<\/td>\n<td>Open-source<\/td>\n<td>Open Source + paid<\/td>\n<td>Open Source + paid<\/td>\n<td>Open-source<\/td>\n<\/tr>\n<tr>\n<td>Popular Apps<\/td>\n<td>Facebook, Instagram<\/td>\n<td>Storyo<\/td>\n<td>JustWatch<\/td>\n<td>HamilTon<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">Cross-platform Application Development Editors and IDEs<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/05\/Inner-Cross-platform-App-Editors.jpg\" alt=\"Cross-platform-App-Editors\" \/><\/p>\n<p>Cross-platform app development market has been undergoing a tremendous increase in popularity. Keeping such things, in mind, we have compiled a list of the best app editors and IDEs. So, read on to know more about the same:<\/p>\n<h3 style=\"font-size: 17px;\">IntelliJ<\/h3>\n<p>This open-source app editor can serve you well while undertaking commercial app development. Although this serves as the standard for Java development in Android, you can also apply the same for cross-platform development. <a href=\"https:\/\/www.jetbrains.com\/idea\/\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">Intellij<\/a> can maximize the productivity of developers with its ergonomic design and powerful static code analysis. It just needs to index your source code following which it offers a super-fast experience along with reliable factoring tools, on-the-fly code analysis and smart code completion.<\/p>\n<h3 style=\"font-size: 17px;\">Cocos2D<\/h3>\n<p><a href=\"https:\/\/www.cocos.com\/\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">Cocos2D<\/a> game-development tool is well suited for building cross-platform game apps and other GUI based interactive programs. It is built from a single codebase and brings JavaScript, C++, Objective-C, and Swift under its purview.<\/p>\n<h3 style=\"font-size: 17px;\">RubyMotion<\/h3>\n<p>You can quickly develop native applications for OS X, Android and iOS using RubyMotion. <a href=\"https:\/\/github.com\/HipByte\/RubyMotion\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">RubyMotion<\/a> presents developers with statistically compiled Ruby language which has been specially designed for serving native mobile platforms. You can customize the development workflow as per requirement using its command-line based extensible toolchain.<\/p>\n<h3 style=\"font-size: 17px;\">AppsMoment<\/h3>\n<p><a href=\"https:\/\/appsmoment.co\/\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">AppsMoment<\/a> code-less platform is perfect for developers who do not have knowledge of web languages. It helps in app development for Android, iPad, iPhone and even Kindle. Developers are offered with more than 300 templates and 120 features which help them create apps without having to break any sweat.<\/p>\n<h3 style=\"font-size: 17px;\">Visual Studio<\/h3>\n<p>This well-published IDE is a product of Microsoft which is well suited for professional-grade app developers. It can help you with the creation of web apps, websites, computer programs, and mobile apps. <a href=\"https:\/\/code.visualstudio.com\/\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">Visual Studio<\/a> uses various software development platforms like Windows Forms, Windows Presentation Foundation, Windows API, etc to produce both managed and native codes.<\/p>\n<p><iframe title=\"Choosing the best mobile app framework\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/4m7msadL5iA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<h3 style=\"font-size: 17px;\">MobinCube<\/h3>\n<p>The best thing about this app builder is that it can be used without any coding requirement. This is why it serves as the ultimate pick of developers who are slowly learning the tricks of the trade. <a href=\"https:\/\/mobincube.com\/\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">MobinCube<\/a> presents the developers with an extremely intuitive visual interface which allows simple drag and drop operation.<\/p>\n<h3 style=\"font-size: 17px;\">Qt<\/h3>\n<p>This interface-led tool is used by most Fortune 500 companies for creating cross-platform applications. It allows developers to design, deploy and maintain the software in a cost-effective manner. <a href=\"https:\/\/www.qt.io\/product\/framework\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">Qt<\/a> is also known to deliver a seamless experience to the ultimate app users with its intuitive and high-performance UI.<\/p>\n<h3 style=\"font-size: 17px;\">Dropsource<\/h3>\n<p>Creating data-driven and powerful iOS and Android apps become super easy with DropSOurce. You can build apps and test them before publishing them over different platforms. Manual coding is not required with <a href=\"https:\/\/www.dropsource.com\/\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">Dropsource<\/a> although developers can use it for accessing editable native source code.<\/p>\n<h3 style=\"font-size: 17px;\">Ionic<\/h3>\n<p>Web developers can grow and scale cross-platform apps using an <a href=\"https:\/\/en.wikipedia.org\/wiki\/Ionic_(mobile_app_framework)\" style=\"color: #3366ff;\" rel=\"noopener norefferer\">Ionic<\/a> Account. Maybe this is why this free open-source tool was used for building more than two million apps till the date.<\/p>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">How Much Does Cross-Platform Multi-Platform App Development Costs and Factors?<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/05\/Inner-How-Much-Does-Cross-Platform-App-Mobile-App.jpg\" alt=\"How-Much-Does-Cross-Platform-App-Mobile-App\" \/><\/p>\n<p>Cost is an important factor that one needs to keep in mind before creating any mobile application. The cross-platform has gained popularity in less time. What is the cost of developing an application in cross platform technology? To all answer all your cost-related questions, let’s read further. Prior to building a cross-platform app, developers need to prepare a budget of its estimated cost. This can be done by considering the factors mentioned below:<\/p>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\">Firstly, you need to consider the amount of research as the ultimate success of the app depends wholly on the same. However, good research doesn’t always mean more cost. Rather it depends on the data collection methods and type of research conducted. Herein it is imperative to note that primary data collection is comparatively more expensive than secondary data collection. However, the reliability of primary data is more.<\/li>\n<li style=\"list-style: square;\">The human resource employed can also determine the cross-platform app development to a great extent. Skilled labour is expensive but at the same time, it can guarantee better results. While in-house developers are affordable, offshore ones come with an expensive tag. It is always best to opt for a mix of both.<\/li>\n<li style=\"list-style: square;\">Next comes the requirement of regular maintenance and routine updates. Usually, the project size and maintenance size go hand in hand.<\/li>\n<li style=\"list-style: square;\">Testing also has a big role to play in determining the cross-platform app development cost. It becomes essential to conduct thorough testing prior to launching the app for public use.<\/li>\n<\/ul>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">Scope of Cross-Platform Mobile Development<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/05\/Inner-Future-of-Cross-platform-App-Development.jpg\" alt=\"Future-of-Cross-platform-App-Development\" \/><\/p>\n<p>Previously developers used to undertake native app -development which could cater only to a specific set of audience. But cross-platform app development has brought significant changes in this field. Developers can now bring along massive time savings and redirect the same towards further development as the cross-platform apps can cater to a wider user base at once. You can take the example of the Flutter by Google, which has gained massive popularity off late. So, read to know more about how Flutter is playing the role of a torchbearer in the field of cross-platform app development:<\/p>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\">This cross-platform technology helps in obtaining native-performing apps and develops it using the built-in components.<\/li>\n<li style=\"list-style: square;\">Users can get ready access to their resources with a large number of packages and plug-ins available over Flutter.<\/li>\n<li style=\"list-style: square;\">A single code base makes it redundant to use an additional JavaScript badge. This, in turn, makes Flutter very simple in operation.<\/li>\n<\/ul>\n<p>The cross-platform applications can easily remove the disparity between OS platforms which arises in its UI and UX. This also reduces the budget which developers have to allocate in app development. As a result, the applications can cater to the requirement of more users on the lookout for affordable solutions.<\/p>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">Final Words<\/h2>\n<p>Cross-platform mobile application development has gained popularity in past years because of its single codebase feature. It has saved 80% of the cost of hiring developers as cross-platform developers can build applications for both Android and iOS. The development time has also lessened due to the WORA model (Write Once Run Anywhere). The platform has given options to the user for different businesses to make any type of application in no downtime. Better user-interface, quick loading time, and easy customization have made the rank of cross-platform technology higher than any other technology. The time will show what replaces this advanced technology or how much this technology evolutes in the coming years.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Are you looking for budget-friendly mobile applications? Do you want an application that reaches a wider audience? Want to hire cross-platform app development company for your dream project? For all of these questions, there’s one solution, i.e. cross-platform application development services. How does it save money? How does it benefit you? Let’s find out with [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":29495,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3159,20],"tags":[4164,4163,4165,102],"yst_prominent_words":[417,11,448,1840,4152,2037,1872,1372,3770,3145,2129,1367,4156,982,7,408,441,4157,1527,4161],"_links":{"self":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/27981"}],"collection":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/comments?post=27981"}],"version-history":[{"count":18,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/27981\/revisions"}],"predecessor-version":[{"id":29815,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/27981\/revisions\/29815"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media\/29495"}],"wp:attachment":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media?parent=27981"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/categories?post=27981"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/tags?post=27981"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/yst_prominent_words?post=27981"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}