{"id":30798,"date":"2020-07-10T12:36:17","date_gmt":"2020-07-10T12:36:17","guid":{"rendered":"https:\/\/theninehertz.com\/?p=30798"},"modified":"2020-07-13T10:46:12","modified_gmt":"2020-07-13T10:46:12","slug":"how-to-do-blockchain-application-development-brief-guide","status":"publish","type":"post","link":"https:\/\/theninehertz.com\/blog\/how-to-do-blockchain-application-development-brief-guide","title":{"rendered":"How to do Blockchain Application Development? [Brief Guide]"},"content":{"rendered":"<p>From the last few years, Blockchain has been a hot topic for discussion on news channels, social media and among office groups. And it does not seem the topics like blockchain and cryptocurrencies are going out of discussions in the coming years as well. <\/p>\n<p>With lots of fans and critics, blockchain and <a href=\"https:\/\/theninehertz.com\/blockchain-development\" style=\"color: #3366ff;\">blockchain application development<\/a> is gaining popularity each passing day. Several startups and established businesses from different industry verticals like manufacturing, media, finance, banking, telecommunication, real estate, healthcare, energy, even the government sector are looking for different blockchain development services. <\/p>\n<p>The demand for business-specific blockchain applications has revolutionized the technological world. People are investing in blockchain development considering technology’s potential in the long term. <\/p>\n<p>If you are looking for blockchain application development for your business and not much aware of the technology. This post is dedicated to you guys, it will provide information about the technical aspects associated with technology and app development. Also, you will get to know how you can integrate blockchain into your business process and make the best choice considering blockchain app development companies. So keep on reading.<\/p>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/07\/tractica-blockchain-market.jpg\" alt=\"tractica-blockchain-market\" \/><\/p>\n<p style=\"text-decoration:underline;text-align:center;\"><i>Source: Tractica<\/i><\/p>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">What are the Blockchain Apps?<\/h2>\n<p><a href=\"https:\/\/en.wikipedia.org\/wiki\/Blockchain.com\" style=\"color: #3366ff;\" target=\"_blank\" rel=\"noopener noreferrer\">Blockchain<\/a> apps or DApps are decentralized applications which mean there is no intermediator to control transactions between the users. Whether it is an exchange of messages, money, or data. Due to which, its possibilities of use in different industries extended to the next level and it turns out to be a relevant option for many businesses. <\/p>\n<p>In a blockchain network, all the members behave like users and mini-servers at the same time. They perform data verification and its exchange within the network. To better understand the working of the blockchain working keep on reading.<\/p>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/07\/Blockchain-Consensus-Algorithms.gif\" alt=\"Blockchain-Consensus-Algorithms\" \/><\/p>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">How DApps Work?<\/h2>\n<p>Before knowing the working of DApps, it is important to understand the working of blockchain.<\/p>\n<p>A blockchain is a network of members where all the data is shared among its members. The data here is chronologically stored in blocks. Once any transaction or data exchange takes place in a blockchain network, everyone will have a record or copy of this action on their own devices.<\/p>\n<p>These data blocks are associated with a chain and once they are linked to the chain, no one can make changes to it. That is why a blockchain is extremely volatile and hard to steal data from it. <\/p>\n<p>Setting up a blockchain requires enough storage space (from a few gigabytes to a terabyte). So one can’t develop a blockchain in a mobile device since it does not contain that much storage space. <\/p>\n<p>Blockchain can be classified into two types based on the type of network.<\/p>\n<p><iframe title=\"What is blockchain and how can it change our society? | Ali Raza Dar | TEDxFHNW\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/kvyKyRZJYh0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<h3 style=\"font-size: 17px;\">#1 Permissionless Blockchain<\/h3>\n<p>It is a kind of blockchain that is accessible to all the members of the network and available to their own devices. Every member in the network has the right to access the code, verify transactions and interact with others while keeping their identity unknown. Bitcoin is the perfect example of permissionless blockchain. <\/p>\n<h3 style=\"font-size: 17px;\">#2 Permissioned Blockchain<\/h3>\n<p>A blockchain that allows only authorized users known as permissioned blockchain. In this blockchain network, every member has their roles and permissions. Not even this, this blockchain is regulated by a definite set of rules for transactions between the network members. The adoption of this kind of blockchain can be witnessed majorly for managing operations within organizations. <\/p>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">What are the Benefits of Blockchain Apps?<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/07\/Key-Benefits-of-Blockchain-Technology-in-Trade-Finance.jpg\" alt=\"Key-Benefits-of-Blockchain-Technology-in-Trade-Finance\" \/><\/p>\n<p>Blockchain apps are gaining popularity since they offer an anonymous and secure platform. Other than this, there is much more that encourages businesses towards the adoption of blockchain technology. <\/p>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\"><b>Public Verification:<\/b> Peer users of a blockchain who are also known as verifiers, confirm each transaction. Through this mechanism, each user can check the working of the system.<\/li>\n<li style=\"list-style: square;\"><b>Transparency:<\/b> In the system, every participant on the network can see data and transactions due to a shared copy on each device. However, they are not authorized to make changes to the data.<\/li>\n<li style=\"list-style: square;\"><b>Privacy:<\/b> Blockchain is a decentralized system with a higher level of transparency. Still, all the interactions and transactions between network members remain anonymous.<\/li>\n<li style=\"list-style: square;\"><b>Integrity:<\/b> There is surety with the blockchain that no data will be changed.<\/li>\n<li style=\"list-style: square;\"><b>Easy Transactions:<\/b> with the blockchain apps, it became easier to set up a wallet and start transactions using cryptocurrency without any additional fees. Whereas many banks face issues in the transaction process using mobile services and the reason behind handling the rejected transactions, commissions, and exchange rates.<\/li>\n<li style=\"list-style: square;\"><b>High Security:<\/b> Banking apps and messaging apps are prone to face security issues. Since it is easier for hackers to enter the system through a man-in-the-middle (MITM) attack during the transaction and steal money. Whereas with Bitcoin, there is no such risk of hack since all the data here is decentralised and every member throughout the chain shares a copy of the data.<\/li>\n<li style=\"list-style: square;\"><b>Great Cryptocurrency Exchange Experience:<\/b> Dealing in cryptocurrencies is quick and easier using mobile services. Besides, the market is extremely volatile and witness frequent changes in prices. The <a href=\"https:\/\/theninehertz.com\/cryptocurrency-exchange-development\" style=\"color: #3366ff;\">cryptocurrency exchange development<\/a> market has a lot of potentials that increases the popularity of cryptocurrency exchange apps.<\/li>\n<\/ul>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">How to Build a Blockchain App?<\/h2>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/07\/Build-engaging-interactive-Blockchain-app.gif\" alt=\"Build-engaging,-interactive-Blockchain-app\" \/><\/p>\n<h3 style=\"font-size: 17px;\">Step 1: Clarify your idea<\/h3>\n<p>Before developing a blockchain application for your business, it is important to clarify the idea behind using blockchain technology. You must be sure that your business requires blockchain in the first place or not. After then think about the problems you want to resolve through DApp going to develop. <\/p>\n<h3 style=\"font-size: 17px;\">Step 2: Do market research<\/h3>\n<p>Market research is a must before moving ahead with blockchain application development. It will give you an idea of solutions available in the market and what better you can offer to take a leap ahead in competition. <\/p>\n<h3 style=\"font-size: 17px;\">Step 3: Analyze your options<\/h3>\n<p>As per technical standpoint, there are four ways to develop a DApp for your business.\n<ol style=\"padding-left: 5%;\">\n<li style=\"list-style: decimal;\">You can use open blockchain likewise <a href=\"https:\/\/ethereum.org\/en\/\" style=\"color: #3366ff;\" target=\"_blank\" rel=\"noopener noreferrer\">Ethereum<\/a> or <a href=\"https:\/\/bitcoin.org\/en\/\" style=\"color: #3366ff;\" target=\"_blank\" rel=\"noopener noreferrer\">Bitcoin<\/a> for your own application.<\/li>\n<li style=\"list-style: decimal;\">You have an option of creating a private network considering blockchain software.<\/li>\n<li style=\"list-style: decimal;\">There is an option of BaaS (Blockchain as a Service) provider, you can choose any of the BaaS products from Amazon, Azure, Microsoft and others. And can take advantage of their cloud storage with integration into your app.<\/li>\n<li style=\"list-style: decimal;\">You can opt for a blockchain network of your own, developed on the platform best suited for your business.<\/li>\n<\/ol>\n<h3 style=\"font-size: 17px;\">Step 4: Choose a platform<\/h3>\n<\/p><p>You can choose from more than 25 blockchain solutions building platforms available in the market. However, here we are mentioning the top blockchain platforms which are commonly used for the development of blockchain apps.<\/p>\n<p><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/07\/blockchain-development-tools.jpg\" alt=\"blockchain-development-tools\" \/><\/p>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\">\n<h3 style=\"font-size: 17px;\">Ethereum<\/h3>\n<p> Flexible and adaptable in nature, Ethereum is the first choice among blockchain app development companies for blockchain application development. It is an open-source and public platform which allows the creation of ICOs with smart-contract functionality other than blockchain dApp development.<\/p><\/li>\n<li style=\"list-style: square;\">\n<h3 style=\"font-size: 17px;\">Multichain<\/h3>\n<p> With Multichain, it became easier for <a href=\"https:\/\/theninehertz.com\/mobile-application-development\" style=\"color: #3366ff;\">mobile app developers<\/a> to develop private blockchain solutions and its deployment within or between multiple organizations.<\/p><\/li>\n<li style=\"list-style: square;\">\n<h3 style=\"font-size: 17px;\">Hyperledger<\/h3>\n<p> Like Ethereum, Hyperledger is also an open-source platform. However, it is used for the development of advanced blockchain solutions. For example, one can develop IoT based blockchain solutions, blockchain apps for supply chain management and more.<\/p><\/li>\n<li style=\"list-style: square;\">\n<h3 style=\"font-size: 17px;\">EOS<\/h3>\n<p> EOS platform aims at providing a blockchain solution that can offer smart contract functionality, decentralized application hosting, and decentralized storage for the enterprise solution which completely eliminates scalability issues majorly seen with Blockchains like Bitcoin and Ethereum. Along with it, it ends up the need of paying any fees from the users.<\/p><\/li>\n<li style=\"list-style: square;\">\n<h3 style=\"font-size: 17px;\">Quorum<\/h3>\n<p> Quorum is an Ethereum based open-source DLT and smart contract platform.<\/p><\/li>\n<li style=\"list-style: square;\">\n<h3 style=\"font-size: 17px;\">IOTA<\/h3>\n<p> IOTA is an open-source DLT based solution that is used as an ideal platform for the development of payment systems. And the reason behind it uses a directed acyclic graph (DAG) and offers facilities like free transactions no matter what transaction size is, handling of unlimited transactions at a time, faster confirmation times, etc. This ensures faster and secure payment services between connected IoT devices.<\/p><\/li>\n<\/ul>\n<p><strong>Also Read:<\/strong>&nbsp;<a class=\"line\" href=\"https:\/\/theninehertz.com\/blog\/how-blockchain-is-reevaluating-the-gaming-industry\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #ff0000;\">How Blockchain is Reevaluating the Gaming Industry?<\/span><\/a><\/p>\n\n<p>Before choosing the platform make sure your development team possesses the necessary skillsets for that specific platform. Since many platforms allow the use of conventional languages like C++, Java, Kotlin, and JavaScript for blockchain app development. But there are others which use Solidity and Simplicity which are currently not that popular and only a handful of blockchain app development companies can offer developers with such expertise.<\/p>\n<p>If your blockchain application is built using languages like Solidity and Simplicity, there are high chances your development team will face problems supporting the app in the absence of expertise. The team will be in need of learning new languages and the principles of blockchain app development. However, these languages are way similar to the conventional languages which end up trouble learning these languages to a great extent.<\/p>\n<h3 style=\"font-size: 17px;\">Step 5: Start the development process<\/h3>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\">The development process for your blockchain application can be different based on the following aspects<\/li>\n<li style=\"list-style: square;\">Platform and language you selected for your project<\/li>\n<li style=\"list-style: square;\">What strategy you are going to adopt for interactions and transactions among all the nodes<\/li>\n<li style=\"list-style: square;\">Your consensus mechanism<\/li>\n<\/ul>\n<p>Other than this, one can also witness the diversity in the development process based on your choice for connecting with an existing blockchain, using a BaaS, or go for creating an all-new blockchain for your own. <\/p>\n<p><iframe title=\"Blockchain Applications | Blockchain Applications Examples | Blockchain Technology | Simplilearn\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/jZ4ZK7SkjCs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<p>Whatever the case will be, the development process will encompass these stages. <\/p>\n<ol style=\"padding-left: 5%;\">\n<li style=\"list-style: decimal;\"><b>Business Analysis:<\/b> Here come the business analysts of the blockchain app development company into action. He will ask for business goals, requirements and expectations from the project and then create a technical specification. This document will contain every single detail required for the development process. Including the details of frameworks, libraries and operating systems they are going to adopt for the blockchain app development.<\/li>\n<li style=\"list-style: decimal;\"><b>Design:<\/b> The <a href=\"https:\/\/theninehertz.com\/ux-design-services\" style=\"color: #3366ff;\">app project design<\/a> can take from 8% to 20% of the complete budget based on its complexity.<\/li>\n<li style=\"list-style: decimal;\"><b>Preparation Stage:<\/b> At this point, the developers set up a needed environment for the blockchain application development likewise APIs, backend and architecture of the application.<\/li>\n<li style=\"list-style: decimal;\"><b>Development and Quality Assurance:<\/b> Development and quality assurance steps of a blockchain app run simultaneously. Means once the development of an application&#8217;s any section is completed, it will proceed for the testing and the later section will enter the development phase and so on. After the completion of the development phase, QA performs rigorous testing of the application to check if all the aspects are working properly or not.<\/li>\n<li style=\"list-style: decimal;\"><b>Deployment:<\/b> After development, the blockchain application is deployed on the platforms like the AppStore and the Google Play Store. If you want your blockchain application to become successful, it is necessary that it must follow all the rules and regulations of the mentioned platforms. Also, keeping an eye over the performance data and user analytics is crucial for the success of the application.<\/li>\n<li style=\"list-style: decimal;\"><b>Maintenance and Support:<\/b> To keep up your application in the competition, it is crucial to offer the application timely maintenance and support. It could include updates to libraries, framework and operating systems. Also, there must be a requirement of the addition of new features and making changes to the application considering the current business needs.<\/li>\n<\/ol>\n<h3 style=\"font-size: 17px;\">Step 6: Deploy and maintain your blockchain app<\/h3>\n<p>Deployment is the final step of the development process. Once the product is ready and you have performed all the tests to check its functioning. Your application is all set to hit the app markets like the Google Play Store, Apple App Store and others. Now you will be able to see its performance and users’ response through user analytic data. <\/p>\n<p>Maintenance is one of the most popular blockchain development services, a blockchain app development company offers. It is necessary to maintain the functionality and security of the application. Also, a timely update for an application makes it compatible with newer operating systems and libraries. <\/p>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">How Much Does Blockchain Application Development Cost?<\/h2>\n<p><a href=\"https:\/\/theninehertz.com\/contact-us\"><img wpfc-lazyload-disable=\"true\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2020\/07\/request-a-quote-to-develop-blockchain-app.jpg\" alt=\"request-a-quote-to-develop-blockchain-app\" \/><\/a><\/p>\n<p>It is not easy to estimate the cost of blockchain application development. However, considering the following factors you might have a costing idea for the development. <\/p>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\">Using an in-house team for blockchain app development<\/li>\n<li style=\"list-style: square;\">Hiring freelance blockchain developers<\/li>\n<li style=\"list-style: square;\">Hiring blockchain app development company for blockchain development<\/li>\n<\/ul>\n<p>Here we are providing a list of the estimated cost of blockchain development for a minimum viable product considering different development resources.<\/p>\n<table class=\"table table-bordered\">\n<tr>\n<th>Skill Level<\/th>\n<th>In-House Developer<\/th>\n<th>Freelance Developer<\/th>\n<th>Blockchain App Development Company<\/th>\n<\/tr>\n<tr>\n<td>Beginner (NewBie)<\/td>\n<td>$500,000<\/td>\n<td>$30,000 to $50,000<\/td>\n<td>$150,000 to $250,000<\/td>\n<\/tr>\n<tr>\n<td>Experts (Pro)<\/td>\n<td>$2000,000<\/td>\n<td>$50,000 to $90,000<\/td>\n<td>$250,000 to $500,000<\/td>\n<\/tr>\n<\/table>\n<p>If you choose an in-house team of developers for blockchain development it will be costlier however, you would get complete control over the development process. It is the right way to choose if your own business is software development. On the other hand, hiring freelancers is least expensive as compared to in-house developers. But it is risk-taking working with freelancers. You may consider freelance developers if the project is small. Because when the scope of a project grows the chances of risk factors also increases with time. <\/p>\n<p>Whereas if your project is large, it is good to hire a blockchain app development company. Not only will it cost lower as compared to an in-house team of developers but also will support your project from time to time through its experience during the development phase.<\/p>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">How to Integrate Blockchain into your Business Process?<\/h2>\n<p>In the above section, you have gone through all the important related to the development of a blockchain application. Now the question arises how can you use your own blockchain application to take advantages like improved security, increased revenue and optimized digital business operations. Let’s have a look.<\/p>\n<ol style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\"><b>For Transactions:<\/b> For transactions, basically, the typical gateways are great. However, if your target audience is aware of cryptocurrencies, incorporating blockchain is the best way to offer fast, secure and easy cryptocurrency transactions for payments.<\/li>\n<li style=\"list-style: square;\"><b>As a Distributed Cloud Storage:<\/b> One can use its blockchain application as decentralized cloud storage. Rather than allocating cloud storage for your application, it is better to choose blockchain technology and provide users with fast and convenient cloud storage.<\/li>\n<li style=\"list-style: square;\"><b>For Supply Chain Management:<\/b> Supply chain mechanism involves exchanges of components between different entities. So blockchain technology can be a great tool for keeping safe and permanent auditable records to look over the complete processing.<\/li>\n<li style=\"list-style: square;\"><b>Authentication:<\/b> A blockchain is a secure tool if you are looking for internal communication or operational management. Since it offers unparalleled security and access only for the authorised users. Other than this, you get the chance of manipulating access levels in permissioned blockchain.<\/li>\n<\/ol>\n<h2 style=\"margin: 5% 0 0 0; color: #3366ff;\">Conclusion<\/h2>\n<p>Hope all the above-mentioned information will help you better understand the technology and its use for blockchain application development. Still having issues, there are several companies which are providing blockchain development services, you can choose the best blockchain app development company and let your blockchain application development project be done in affordable pricing. <\/p>\n<p><b><u>FAQs<\/u><\/b><\/p>\n<h3 style=\"font-size: 17px;\">&#9733; What is blockchain development?<\/h3>\n<p>The development of a decentralized, transparent, immutable and publicly accessible database is called blockchain development. Here blocks contain the digital information or can say transactional data. These blocks are further connected with each other using a hash function in a way that the current block contains the hash code of the previous block while the next block keeps the hash code of the current block thus forming a chain that is called a blockchain whereas the process is known as blockchain development. <\/p>\n<h3 style=\"font-size: 17px;\">&#9733; Which technology is best for blockchain app development?<\/h3>\n<p>Here is the list of some of the best technologies being used in 2020 for blockchain app development. <\/p>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\">Solidity<\/li>\n<li style=\"list-style: square;\">Simplicity<\/li>\n<li style=\"list-style: square;\">Embark<\/li>\n<li style=\"list-style: square;\">DApp Browsers<\/li>\n<li style=\"list-style: square;\">Truffle<\/li>\n<li style=\"list-style: square;\">Etherscan<\/li>\n<li style=\"list-style: square;\">Parity<\/li>\n<li style=\"list-style: square;\">Metamask<\/li>\n<li style=\"list-style: square;\">Open Zeppelin<\/li>\n<\/ul>\n<p>Which technology will be the best for your blockchain app development project, you can consult about it with the team of blockchain developers. <\/p>\n<h3 style=\"font-size: 17px;\">&#9733; Which are top blockchain development tools in 2020?<\/h3>\n<p>There are numerous tools available in the market for blockchain development. Here we are providing a list of blockchain development tools, one can use for the development of blockchain apps (DApps) and smart contracts.<\/p>\n<ul style=\"padding-left: 5%;\">\n<li style=\"list-style: square;\">Geth<\/li>\n<li style=\"list-style: square;\">Mist<\/li>\n<li style=\"list-style: square;\">Remix IDE<\/li>\n<li style=\"list-style: square;\">GanacheCLI<\/li>\n<li style=\"list-style: square;\">Solium<\/li>\n<li style=\"list-style: square;\">Embark<\/li>\n<li style=\"list-style: square;\">EtherScripter<\/li>\n<li style=\"list-style: square;\">Blockchain Testnet<\/li>\n<li style=\"list-style: square;\">Metamask<\/li>\n<li style=\"list-style: square;\">Truffle<\/li>\n<\/ul>\n<p>To find the best blockchain tool for your project, you can consult the team of blockchain experts.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>From the last few years, Blockchain has been a hot topic for discussion on news channels, social media and among office groups. And it does not seem the topics like blockchain and cryptocurrencies are going out of discussions in the coming years as well. With lots of fans and critics, blockchain and blockchain application development [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":30813,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[345],"tags":[4507,4508,4509,4510],"yst_prominent_words":[417,11,2306,396,1843,448,1890,1886,4499,4502,1378,1297,4484,1381,3749,4505,7,10,4506,2695],"_links":{"self":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/30798"}],"collection":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/comments?post=30798"}],"version-history":[{"count":21,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/30798\/revisions"}],"predecessor-version":[{"id":30888,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/30798\/revisions\/30888"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media\/30813"}],"wp:attachment":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media?parent=30798"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/categories?post=30798"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/tags?post=30798"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/yst_prominent_words?post=30798"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}