{"id":7800,"date":"2018-05-11T09:17:15","date_gmt":"2018-05-11T09:17:15","guid":{"rendered":"https:\/\/theninehertz.com\/?p=7800"},"modified":"2018-05-11T09:17:15","modified_gmt":"2018-05-11T09:17:15","slug":"general-data-protection-regulation-gdpr","status":"publish","type":"post","link":"https:\/\/theninehertz.com\/blog\/general-data-protection-regulation-gdpr","title":{"rendered":"Everything to know about the General Data Protection Regulation"},"content":{"rendered":"<p>Now that more and more customers are falling prey to the rising issue of security and privacy tampering, data protection has become a necessity. After big ventures like Facebook and Twitter failed to keep the data of its users secured and the hit of the Analytica fiasco happened, it was more than enough to push the <strong>European Union<\/strong> to take a reasonable action.<\/p>\n<p>The new law of <strong>GDPR<\/strong>, i.e. General Data Protection Regulation which will come into existence on 25th May 2018, by the <a href=\"https:\/\/www.eugdpr.org\/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>European Union<\/strong><\/a> which provisioned that every business using the personal data of its users who are a part of EU had to be protected.<\/p>\n<p>All the transactions that take place regarding the personal data of users within the member states of the European Union fall under this category. It is also applicable to any data that is going outside the EU.<\/p>\n<p>The reason why GDPR exists is uni-fold. Since there are more cases of security breaching every day, the concern of privacy was seeing a rise. The uncertainty of security of the data by companies was not going unnoticed by the users, leading them to step up and take their own measures. For instance, filling up false information! Hence, the regulation of General Data Protection Regulation came as a welcome change for the users.<\/p>\n<h2><span style=\"color: #3366ff;\">How does GDPR impact app development companies?<\/span><\/h2>\n<p>The initiative of bringing GDPR into existence has taken the entire market by a storm. <strong><a href=\"https:\/\/theninehertz.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">App development companies<\/a><\/strong> are facing a major transformation in how they manage the data of their users. Here is how that is happening!<\/p>\n<p><img wpfc-lazyload-disable=\"true\" loading=\"lazy\" class=\"aligncenter size-full wp-image-7803\" src=\"https:\/\/theninehertz.com\/wp-content\/uploads\/2018\/05\/Everything-to-know-about-the-General-Data-Protection-Regulation-1.jpg\" alt=\"Everything to know about the General Data Protection Regulation\" width=\"750\" height=\"500\" \/><\/p>\n<ul>\n<li>\n<h3>Consent of users before moving data:<\/h3>\n<\/li>\n<\/ul>\n<p>The implementation of GDPR transferred the power of moving the data of users from the company to the users themselves. Which states that if ever the developers want to collect, use or move the data of users, they can only do so after the explicit consent of the users.<\/p>\n<ul>\n<li>\n<h3>Authority of erasing data:<\/h3>\n<\/li>\n<\/ul>\n<p>The users will now have the complete authority to erase their personal data permanently. Other than this, they can also monitor and stop their data from being published if it is overstepping the mark of the initially agreed upon terms.<\/p>\n<ul>\n<li>\n<h3>Notifying about security breach:<\/h3>\n<\/li>\n<\/ul>\n<p>The European Union has also raised the bar set for the security measures carried out by companies. According to the new rules, if any breach happens, the users and the associated authorities will have to be notified about it within 72 hours of the incident. If they fail to do so under any circumstances, they will have to face strict consequences.<\/p>\n<ul>\n<li>\n<h3>Maintaining privacy from the beginning:<\/h3>\n<\/li>\n<\/ul>\n<p>Many <strong>app development companies<\/strong> follow the concept of building measures that restrict any unnecessary flow of their users&#8217; data before, during and after the stage of development. Under The rule of GDPR, this will now be a mandatory requirement and not just a practice that some companies follow.<\/p>\n<h2><span style=\"color: #3366ff;\">What are the after effects of not complying with GDPR?<\/span><\/h2>\n<p>If any company fails to comply with the General Data Protection Regulation policies, then they have to pay a heavy fine. For instance, a company is found out to be ignorant of protecting its user&#8217;s data, they will have to pay a fine as high as 4% of their revenue generated worldwide. It not might be as shocking for small enterprises, but if we talk about big enterprises, it would cost them millions of euros!<\/p>\n<p>At<strong> The NineHertz<\/strong>, we are providing services that are compliant with the GDPR, freeing you from any worries about your app security. To know more, <a href=\"https:\/\/theninehertz.com\/gdpr\/index.html\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>get in touch with us<\/strong><\/a>!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Now that more and more customers are falling prey to the rising issue of security and privacy tampering, data protection has become a necessity. After big ventures like Facebook and Twitter failed to keep the data of its users secured and the hit of the Analytica fiasco happened, it was more than enough to push [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":7806,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[44],"tags":[35,38,150,151,152,153,97],"yst_prominent_words":[],"_links":{"self":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/7800"}],"collection":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/comments?post=7800"}],"version-history":[{"count":0,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/posts\/7800\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media\/7806"}],"wp:attachment":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media?parent=7800"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/categories?post=7800"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/tags?post=7800"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/yst_prominent_words?post=7800"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}