{"id":4173,"date":"2017-08-17T13:16:49","date_gmt":"2017-08-17T13:16:49","guid":{"rendered":"https:\/\/theninehertz.com\/?page_id=4173"},"modified":"2020-08-25T07:29:05","modified_gmt":"2020-08-25T07:29:05","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/theninehertz.com\/terms-and-conditions","title":{"rendered":"Terms and Conditions"},"content":{"rendered":"<section class=\"privacy-header\">\n<div class=\"container\">\n<h1>General Terms of Work, Responsibilities of the Client and Liabilities<\/h1>\n<p class=\"aos-item bold\" data-aos=\"fade-up\">Provision of site content such as multimedia and text is entirely the client’s responsibility. Such information must be provided to Nine Hertz prior to commencing the work.<\/p>\n<p class=\"aos-item\" data-aos=\"fade-up\">Data back-up is entirely the responsibility of the client. Nine Hertz is not responsible for any loss of content due to any reason or circumstance.<\/p>\n<\/div>\n<div class=\"container container_custom\">\n<p class=\"aos-item\" data-aos=\"fade-up\">Nine Hertz would not be contractually responsible for any graphics, artwork, data entry or web hosting related to the project unless it is expressed specifically, paid for and agreed by both the client and Nine Hertz. The above-specified materials will remain the property of Nine Hertz. This is regardless of the fact that it is developed by Nine Hertz or supplied by the customer, the exception being a modification in agreement that is specifically agreed upon.<\/p>\n<p>        <a href=\"https:\/\/theninehertz.com\/contact-us\" class=\"btn style_3\">Contact Us<\/a>\n    <\/p><\/div>\n<\/section>\n<section class=\"company-policy padd50\">\n<div class=\"container container_custom\">\n<div class=\"listing-2\">\n<p>Nine Hertz will do its best to adhere to all deadlines. However, it will not be responsible for a deadline missed due to circumstances that are beyond its control. These include but are not limited to issues with deployment, third-party support, occurrence of bottlenecks, communication delays, resource unavailability and other similar situations.<\/p>\n<p>We give our clients an opportunity to review the content and appearance of websites that are developed during the project execution and also after completion. We provide a seven-day window by which the client can come back for revisions, failing which we will automatically consider that it has been approved and accepted.<\/p>\n<p>Copyright to logos, files and data supplied by the client will be owned by the client and the client will grant Nine Hertz the authority to modify and use them. Obtaining relevant copyrights of any third-party material will be the client’s responsibility. The responsibility of granting Nine Hertz the copyright permissions also lies with the client. Nine Hertz is insulated from any claims that arise from the materials provided by the client. This could be as a result of improper copyright permissions or negligence by the client. We consider the contract a guarantee that the client has taken care of these issues. Nine Hertz reserves the right to ask for evidence that expresses the authority and permission.<\/p>\n<p>Nine Hertz does not assume responsibilities for any changes caused by the client or a third-party. These could include but would not be limited to deletions, modifications or additions. However, Nine Hertz could be willing to rectify these for an additional charge.<\/p>\n<\/div>\n<hr \/>\n<h2 class=\"newTitle \">Payment Conditions<\/h2>\n<div class=\"listing-2\">\n<p>We accept cheque, bank transfers and cash; however, we could decline payment in any of these forms and this is a right that we reserve. We also reserve the right to take back any of these payment methods and to change the pricing at any given point without any prior notice.<\/p>\n<p>A cancellation fee could be charged if the client cancels or discontinues the project midway. This fee could be in accordance to the state of the project at the point of discontinuance or cancellation<\/p>\n<p>Legal action will be initiated in case there is a nonpayment of overdue amount or cancellation fees.<\/p>\n<\/div>\n<hr \/>\n<h2 class=\"newTitle \">Conditions regarding support and third-party<\/h2>\n<div class=\"listing-2\">\n<p>Nine Hertz provides free-of-cost support during the first month after launch. Following this period, support is charged on an hourly rate as agreed upon. This support would only include bug fix and e-mail support. Change in rules, architecture, and enhancements\/add-on are beyond the scope of this support.<\/p>\n<p>Third-party product\/services and support that are integrated into the website and demand payment, licensing, copyright and the like will be client’s liability and responsibility. These could also be procured on behalf of the client by us for a fee. This fee would not include out-of-pocket expenses or claims by third-party.<\/p>\n<p>Nine Hertz does not provide any guarantee or warranty for any third-party products or services used.<\/p>\n<p>Nine Hertz considers any third-party upgrade of services and products beyond its scope, and may warrant a revision in price considering the feasibility per its discretion.<\/p>\n<\/div>\n<hr \/>\n<h2 class=\"newTitle \">Conditions that Guide Add-on\/Enhancement, Rework &#038; Billing<\/h2>\n<div class=\"listing-2\">\n<p>We have a “modification management” process in place where the additional work that is beyond the scope of the original project is billed. Additional work after wireframe signoff would attract increase in charge and extension of deadline.<\/p>\n<p>Nine Hertz has a policy of doing minor tweaks at no additional charge but if it is found that undue advantage is being taken by abusing this policy, we charge extra. The charges could range from $10 to $15 per hour. A list of these additional tasks would be made and provided to the client.<\/p>\n<p>Nine Hertz usually conforms to the project budget but certain add-ons or enhancements may attract additional fees, which would be communicated to the client in advance.<\/p>\n<p>After the approval, any tweak or rework is considered an add-on and is charged separately.<\/p>\n<p>All payments are to be made by the due date without any discounts, debt settlement, or deductions.<\/p>\n<\/div>\n<hr \/>\n<h2 class=\"newTitle \">Liability Limitations<\/h2>\n<div class=\"listing-2\">\n<p>Nine Hertz exercises reasonable precautions and skills while executing the project. Having said this, we exclude ourselves from any representations, keeping us away from any express or implied warranty in terms of correctness, quality, timelines or accuracy of the service.<\/p>\n<p>Nine Hertz excludes its employees, contractors and itself from the following: Any or all liability due to omissions, time, any negligence, etc., that can damage the functioning of the website. This exclusion of liability also includes damage to artwork, content or data provided by the client. The losses could be due to negligence or any other reason.<\/p>\n<p>Excluding personal injury or death as a result of omissions or negligence, Nine Hertz shall not be held responsible for any damages that arise from the tort, contract or otherwise. The damages could be loss or reduction in profit or any claims made by third-party.<\/p>\n<p>We do not hold ourselves responsible for the performance of third-parties and we shall not be held responsible for their inefficiencies.<\/p>\n<\/div>\n<hr \/>\n<h2 class=\"newTitle \">Delivery and Approvals<\/h2>\n<div class=\"listing-2\">\n<p>The projects are usually divided into various stages and the work commencement on the next stage only begins once the payment for the completed stage is made as per the agreement.<\/p>\n<p>On completion of the project, the developed website would be uploaded to the customer end of our website for approval. The website is transferred to destination server after approval. However, we reserve the right to delay this transfer until the full realization of payment is done.<\/p>\n<p>All the material and codes developed will be transferred to the client upon completion and the ownership is only transferred to the client post full payment.<\/p>\n<p>Nine Hertz holds the right to publish the completed projects for the purpose of reference to generate new customers. If the client wishes to prevent such usage, we must be informed well in advance and appropriate approvals shall be obtained.<\/p>\n<\/div>\n<hr \/>\n<h2 class=\"newTitle \">Timescale<\/h2>\n<p>We put in our full efforts to complete the project on time. We begin the work on clients’ projects only after receiving the agreed upon deposit that could be anywhere between 30 to 50% of the agreed price. However, the timelines may need to be extended depending on the factors that are beyond Nine Hertz’s control.<\/p>\n<hr \/>\n<h2 class=\"newTitle \">Jurisdiction<\/h2>\n<p>All the terms shall be interpreted and governed as per the Indian law. All parties irrevocably consent that Indian courts would have the exclusive jurisdiction towards settling disputes that originate from, in connection or under the terms and conditions listed here. You confirm the acceptance of these terms and conditions when you place an order with us.<\/p>\n<hr \/>\n<h2 class=\"newTitle \">Severability<\/h2>\n<p>In case any one or more of the points in the terms and conditions delineated here is deemed illegal, invalid or unenforceable, the rest of the points will still remain unimpaired and the order and\/or agreement would not be held void for this particular reason. The point in question would be replaced by one that comes close to the intent expressed in it.<\/p>\n<\/div>\n<\/section>\n","protected":false},"excerpt":{"rendered":"<p>General Terms of Work, Responsibilities of the Client and Liabilities Provision of site content such as multimedia and text is entirely the client’s responsibility. Such information must be provided to Nine Hertz prior to commencing the work. Data back-up is entirely the responsibility of the client. Nine Hertz is not responsible for any loss of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"Inner-template.php","meta":[],"yst_prominent_words":[1233,1228,1229,692,1226,1234,1227,1230,952,406,1223,1225,1222,1232,437,1231,953,1224,1221,1109],"_links":{"self":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/pages\/4173"}],"collection":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/comments?post=4173"}],"version-history":[{"count":1,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/pages\/4173\/revisions"}],"predecessor-version":[{"id":32206,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/pages\/4173\/revisions\/32206"}],"wp:attachment":[{"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/media?parent=4173"}],"wp:term":[{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/theninehertz.com\/wp-json\/wp\/v2\/yst_prominent_words?post=4173"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}